fix: configure apps
